# Правила работы с задачами

В ходе разработки курса создаются задачи, требующие решения участниками команды.
Задачи создаются и обрабатываются через функционал Issues.
### Где найти задачи
Открыть список задач можно перейдя на главной странице репозитория выбрав в соответствующий пункт Issues меню, расположенного под названием репозитория, прямая ссылка на список задач https://github.com/EduWebDotNet/methodology/issues.
![изображение](https://github.com/EduWebDotNet/methodology/assets/129661284/1437b495-e887-46c6-8e2f-6f9a44d29fd0)

### Как найти свободную задачу
В списке задач можно использовать фильтры по различным параметрам.

![изображение](https://github.com/EduWebDotNet/methodology/assets/129661284/db55b845-8da6-43b3-a77e-dbd31b81de42)

Для поиска свободных задач необходимо применить фильтры: только открытые задачи и пустой список исполнителей _Assignee_.
Фильтр можно включить двумя способами:

- интерактивно нажав кнопки _Open_, и _Assignee_ выбрав пункт _Assigned to nobody_
- указав в строке поиска `is:issue is:open no:assignee`

Прямая ссылка на [свободные задачи](https://github.com/EduWebDotNet/methodology/issues?q=is%3Aopen+is%3Aissue+no%3Aassignee)
	

> TODO: 
> 1. на будущее при необходмиости подумать над тем как отличать задачи, которые пока рано брать в работу, по которым есть препятствия для решения. Варианты: использовать Labels, Milestones, статусы в проектах, ключевые слова в заголовках.
> 2. подумать над значениями Labels
> 3. подумать над тем как отличать более приоритетные задачи которые нужно решать в первую очередь от менее приоритетных. Варианты: использовать Labels, Milestones, статусы в проектах.

### Как закрепить выбранную задачу за собой
Для закрепления выбранной задачи, необходимо в задаче указать себя исполнителем нажав ссылку _assign yourself_ в пункте _Assignees_.
![изображение](https://github.com/EduWebDotNet/methodology/assets/129661284/0da20694-9da2-456d-8df7-44bde0a2c7fa)

Если у вас нет прав назначать себя исполнителем, необходимо написать в комментариях к задаче о необходимости назначить вас исполнителем.
Если вы не знаете какую взять задачу напишите об этом в чате Методологов.

> TODO: подумать над тем нужно ли при принятии в работу или чуть позже указывать плановую дату решения, и как указывать.

### Как просмотреть список своих задач
Для просмотра списка открытых и назначенных на вас задач, необходимо применить фильтры: только открытые задачи и вы в качестве исполнителя _Assignee_ .
Фильтр можно включить двумя способами:

- интерактивно нажав кнопки _Open_, и _Assignee_ выбрав себя
- указав в строке поиска `is:open is:issue assignee:@me `

Прямая ссылка на [список открытых и назначенных на вас задач](https://github.com/EduWebDotNet/methodology/issues?q=is%3Aopen+assignee%3A%40me)

### Куда задавать вопросы по реализации
Вопросы по реализации необходимо задавать в комментариях к задаче, но также можно обсуждать в чате Методологов, в личном чате с автором задачи, на встречах, при этом результаты обсуждения правильнее будет отразить в комментариях к задаче.

### Куда сообщать промежуточный статус о прогрессе
Промежуточный статус решения задачи необходимо отражать в комментариях к задаче, также сообщать в чате методологов два раза в неделю.
Необходим указать:

- Процент выполнения
- Прогнозную дату выполнения
- Кратко описать что сделано
- Что осталось сделать
- Какие были проблемы
- Что мешает решить задачу.

Если изменений по задаче не было, то об этом тоже нужно написать, в том числе уточнить прогнозную дату выполнения и что мешает решить задачу.

### Как определить что задача реализована полностью (критерии приёмки)
При принятии задачи в работу, если в самой задаче не описан критерий приемки, написать в комментариях ваше видение о результате выполнения и критерии, получить подтверждение от автора задачи.
После выполнения задачи сверить полученный результат с ожидаемым.

### Как послать задачу на проверку
После выполнения задачи, убедившись что задача полностью реализована, необходим отправить ее на проверку автору. Для отправки на проверку необходимо сделать PR, написать комментарий в задаче, автор получит оповещение, в случае если замечаний нет, напишет об этом в ответных комментариях.

### Когда результат работы попадёт в master
После того как автор задачи подтвердил выполнение, необходимо результат поместить в master.
После помещения в ветку master можно перевести задачу в статус Закрыто.

### Что делать если вы не можете продолжить работу над задачей
Если исполнитель не может продолжить работу над задачей, то он освобождает ее, сообщает об этом в комментариях к задаче и в чате Методологов. Если по задаче достигнуты какие-то результаты, по возможности предлагает участникам в чате взять данную задачу и передать наработки.

### Снятие задачи с исполнителя при отсутствии активности
Если в течении двух недель от исполнителя не поступает информации о результатах работы над задачей, то автор задачи или иное ответственное лицо снимает задачу с исполнителя.

### Что делать если требуются другие задачи для решения текущей
Если для решения задачи требуется создание новых задач, то исполнитель создает новые задачи, в комментарии к основной задаче вносит информацию об этом и указывает ссылки на новые задачи.
